# coding:utf-8
# 查看数据信息的

"""
两个特征文件 data_part1 和 data_part2，每个文件第一行是字段名，之后每一行代表某个指标的检查结果（指标含义已脱敏）
每个文件各包含3个字段，分别表示病人id、体检项目id 和体检结果，部分字段在部分人群中有缺失
其中，体检项目id字段，数值相同表示体检的项目相同。 体检结果字段有数值和字符型，部分结果以非结构化文本形式提供

标签文件 train.csv，是训练数据的答案：包含六个字段，第一个字段为病人id，与上述特征文件的病人id有对应关系
之后五个字段依次为收缩压、舒张压、甘油三酯、高密度脂蛋白胆固醇和低密度脂蛋白胆固醇
"""

import pandas as pd
import warnings
import sys

# data1 = pd.read_csv('D:/kaggle/health/meinian_round1_data_part1_20180408.txt', sep='$')
# data2 = pd.read_csv('D:/kaggle/health/meinian_round1_data_part2_20180408.txt', sep='$')

# print data2.info()
# print data1.info()

"""
data1
train_data1RangeIndex: 4430918 entries, 0 to 4430917
Data columns (total 3 columns):
vid              object
table_id         object
field_results    object
dtypes: object(3)
data2
RangeIndex: 3673450 entries, 0 to 3673449
Data columns (total 3 columns):
vid              object
table_id         object
field_results    object
dtypes: object(3)
"""

# train = pd.read_csv('D:/kaggle/health/meinian_round1_train_20180408.csv', encoding='gbk')
# print train.shape # (38199, 6)
sys_new = reload(sys)
sys_new.setdefaultencoding('utf-8')

warnings.filterwarnings("ignore")

if __name__ == '__main__':
    train_data = pd.read_csv(r'D:/kaggle/health/train_set.csv')
    test_data = pd.read_csv(r'D:/kaggle/health/test_set.csv')

    """进行了数据清洗之后的结果"""
    # print train_data.shape
    # (38199, 409)
    # print test_data.shape
    # (9538, 409)
    # print train_data.head(5)

    # print train_data.info()
    # 查看各个数据列的格式
    """
    <class 'pandas.core.frame.DataFrame'>
    RangeIndex: 38199 entries, 0 to 38198
    Columns: 409 entries, vid to A705
    dtypes: float64(88), int64(1), object(320)
    memory usage: 119.2+ MB
    """

    """
                                  vid    收缩压  舒张压  血清甘油三酯  血清高密度脂蛋白  血清低密度脂蛋白  
    0  002d1e4859fafd9ded2a2e1e7c839b62  165.0  100.0    2.08           1.29             3.24   
    1  92dd479df5e30ab6a0a1cf85ac53efc3  141.0   97.0    2.64           1.36             4.75   
    2  6bb59d517c4c70f8f50844d24fbd0355  120.0   80.0    1.37           1.25             2.66   
    3  0ebb42adae512906f7e1135da734ea63  100.0   70.0    1.27           2.21             1.73   
    4  ebe7811e919109c42c092abbd98b4ca6  110.0   80.0    0.80           1.87             2.21 
    """
    # print test_data.head(5)
    """
                                    vid  收缩压     舒张压  血清甘油三酯  血清高密度脂蛋白  血清低密度脂蛋白  
    0  c643a744e2e94f3ff354d920958bd37b  NaN        NaN     NaN             NaN             NaN   
    1  a81c1fc0cfa8c0fbc450d2ffeae14b9f  NaN        NaN     NaN             NaN             NaN   
    2  2af0da8f6f0b8d642f88b3a8194408b6  NaN        NaN     NaN             NaN             NaN   
    3  2bd361a4c5b9b0d5aab62c101daa4ee6  NaN        NaN     NaN             NaN             NaN   
    4  16107e514ed0f51c4e39b1a0fa5a04f9  NaN        NaN     NaN             NaN             NaN   
    """
    # print train_data.info
    """
        bound method DataFrame.info of                                     vid    收缩压    舒张压  血清甘油三酯  血清高密度脂蛋白  \
    0      002d1e4859fafd9ded2a2e1e7c839b62  165.0  100.0    2.08      1.29   
    1      92dd479df5e30ab6a0a1cf85ac53efc3  141.0   97.0    2.64      1.36   
    2      6bb59d517c4c70f8f50844d24fbd0355  120.0   80.0    1.37      1.25   
    3      0ebb42adae512906f7e1135da734ea63  100.0   70.0    1.27      2.21   
    4      ebe7811e919109c42c092abbd98b4ca6  110.0   80.0    0.80      1.87   
    5      c2690ddf171a3de695dced12fd93c1d1  110.0   80.0    1.40      1.74   
    6      d7017fda4e550b14008c730854b89b95  130.0   78.0    2.50      1.22   
    7      d6b92248a262a491d6250dcebc103e71  111.0   71.0    3.36      1.08   
    8      345742c522a571dbb0483474242d3484   94.0   64.0    0.62      1.34   
    9      c00413e3df904256278f6938ab55ab7a  164.0   98.0    1.12      1.51   
    10     9b827fd2cf0c3cbf3f7fdabc30641a0a  120.0   82.0    1.12      1.50   
    11     5f5999d871374b11168f040b291ae43f  123.0   80.0    1.49      0.97   
    12     970c4a5db91eb4d677ef23bda833ef27  109.0   48.0    0.77      1.17   
    13     086d3fa10ae104f6d27b1e37d8462398  132.0   73.0    0.84      1.71   
    14     917f4674052241ce1b33bc8429f3263b  155.0   84.0    1.85      1.12   
    15     53e02ec25395372d4e3d07f63689d7a6  127.0   80.0    0.69      1.67   
    16     0a238167c1c9778ed3cb6867b5407f3b  136.0   94.0    1.14      1.29   
    17     3cd05fc4212d5fa0fee7909fdc39119e   98.0   54.0    1.18      1.46   
    18     2aa3547caf90d7bcb777d57466fb61f6  122.0   90.0    1.60      1.19   
    19     771f6689382f9ae933bb135c9aab700f  129.0   70.0    0.36      2.12   
    20     bbba4e711b50d7a650844a7e14ec8a0a  136.0   71.0    2.40      1.25   
    21     b778070e13885bc3a2de2c5c7b00ec95   91.0   61.0    1.45      1.19   
    22     733e78f190b7d2ce9f07125e0a70b3a5  122.0   74.0    1.37      1.92   
    23     2d77c20636fe61bdf6c51482a6b79f8b  116.0   78.0    0.75      0.93   
    24     e8d94831d6123be7d259e5d8a95c3c5b  110.0   74.0    0.82      1.75   
    25     1bdc93d1f65f2c9a7ae83f781fceafea  118.0   72.0    0.77      1.37   
    26     8933ea64e4bf1f76fc048e5bd9eb0f74  131.0   82.0    0.93      1.24   
    27     5a94237971c22c7ac2dfa7e38f9af780  140.0   89.0    3.11      0.97   
    28     3e7b0be225e9a8b05e72d9637989e46f  130.0   80.0    3.33      1.13   
    29     77edb148d61e75dc1876ebef74530b3d  110.0   80.0    1.07      1.08   
    ...                                 ...    ...    ...     ...       ...   
    38169  c2800e12a75270bfa126208047858a53  122.0   74.0    1.19      1.25   
    38170  0798910f9820ce6fdd77a1f9c19e9f5a  150.0  106.0    2.96      1.42   
    38171  0af2a433568b7f2973d65bd67ef0473e  167.0  111.0    9.12      2.17   
    38172  3d61c062412babb0b991d6b836d67ec2  112.0   57.0    0.86      1.20   
    38173  ff3c7a545f075d402a5ab6715d6651ac  114.0   72.0    1.11      1.86   
    38174  5ad677e29d822878f066b1aa63cd1fff  103.0   73.0    1.16      1.19   
    38175  5857fd016d575bad009b426a758c2719  103.0   67.0    0.68      1.60   
    38176  1b7ee167fdde3b39473bfc224b809d36  114.0   71.0    1.84      1.55   
    38177  75f36eb3d5b12104ec4c9ca3759a4d48  110.0   65.0    1.90      1.10   
    38178  affedcb88106f845b3ea8dd3796246cc  123.0   78.0    1.36      2.10   
    38179  634ae298f329c407ff5f514a796333e1  150.0   92.0    1.27      1.37   
    38180  c633a84494186b96f63956e9c044f7cf  108.0   64.0    1.07      1.83   
    38181  ef0ce77059c1b56720e3e48b8c39601a  119.0   75.0    1.06      1.29   
    38182  f3ad6b03dea0b6dc9a04a6b06f936745  141.0   97.0    2.64      2.20   
    38183  1c92dec406b4c3ed50e8598b806a9bf6  133.0   86.0    2.19      1.31   
    38184  44390c62bcbe3e3e423518a48d3eaf57  102.0   67.0    2.78      1.00   
    38185  fb2e0c048f6836ba0e04002121b5667a  134.0   70.0    1.36      1.20   
    38186  37edef1c0c8c7e2255304e5866f3e32f  154.0  105.0    2.51      1.65   
    38187  b28066511f74f06627e4d25b8cd477b5  135.0   90.0    2.98      0.94   
    38188  12f3c04ee86cefe0eef46e9c0afda75f  110.0   82.0    3.24      1.47   
    38189  e4714216d6db4df2f7a4cc478f7a2220  121.0   70.0    2.25      1.32   
    38190  41c0cb69462c8b56afa30e153ff7462f  190.0  105.0    1.46      1.98   
    38191  bb97bb7a6565a392356223d824340b75  142.0   81.0    2.18      1.50   
    38192  b38fe8fa0b20ed8ea17333ec80d29dbe  160.0   76.0    0.62      1.86   
    38193  9d1ebd103c4f3b69f701f40b1981b4f4  117.0   77.0    3.34      1.26   
    38194  5f556f4c682ecc43da8780ef0d9a2dae  120.0   80.0    3.94      1.39   
    38195  c665a9e1f2b98d27c94967ec0be02152  110.0   80.0    1.19      1.04   
    38196  cfdde912fdb2e1c6ccc0cff633eecfbc  150.0   98.0    1.31      1.80   
    38197  eb4dbb02ef6dde8a5ea4fb7ee2122178   95.0   64.0    0.68      1.89   
    38198  49ae2a299f0028dc3ab6bc36347fbda9  118.0   69.0    1.15      2.14   
    
           血清低密度脂蛋白  Unnamed: 0  004997  \
    0          3.24          42     NaN   
    1          4.75       33084     NaN   
    2          2.66       24317     NaN   
    3          1.73        3290     NaN   
    4          2.21       52817     NaN   
    5          2.09       43611     NaN   
    6          4.53       48203     NaN   
    7          2.88       48145     NaN   
    8          1.67       11921     NaN   
    9          2.79       43073     NaN   
    10         2.56       34994     NaN   
    11         2.57       21541     NaN   
    12         1.76       33952     NaN   
    13         2.87        1846     NaN   
    14         4.23       32753   17.32   
    15         2.54       18969     NaN   
    16         3.76        2254   17.42   
    17         3.10       13798   18.52   
    18         2.43        9682     NaN   
    19         2.15       26868     NaN   
    20         3.70       42109     NaN   
    21         3.46       41160     NaN   
    22         3.94       25973     NaN   
    23         1.76       10310   17.56   
    24         3.07       52130     NaN   
    25         3.35        6284   18.40   
    26         4.22       30938   15.64   
    27         2.64       20444     NaN   
    28         3.50       14158     NaN   
    29         2.45       27062     NaN   
    ...         ...         ...     ...   
    38169      1.64       43626     NaN   
    38170      2.76        1658     NaN   
    38171      1.81        2434     NaN   
    38172      1.64       13928     NaN   
    38173      3.44       57112     NaN   
    38174      2.88       20493     NaN   
    38175      2.37       19955     NaN   
    38176      3.72        6193     NaN   
    38177      4.61       26630     NaN   
    38178      3.93       39499     NaN   
    38179      2.12       22427     NaN   
    38180      3.09       44499     NaN   
    38181      2.43       53472     NaN   
    38182      4.37       54561     NaN   
    38183      3.05        6474     NaN   
    38184      3.50       15431     NaN   
    38185      3.10       56201     NaN   
    38186      1.68       12718     NaN   
    38187      3.60       40031     NaN   
    38188      4.17        4277     NaN   
    38189      2.02       51143     NaN   
    38190      3.23       14892     NaN   
    38191      3.96       42069   15.72   
    38192      3.56       40270     NaN   
    38193      3.10       35346     NaN   
    38194      2.34       21539     NaN   
    38195      1.56       44535     NaN   
    38196      3.43       46638     NaN   
    38197      1.66       52676     NaN   
    38198      1.86       16643     NaN   
    
                                                        0101  \
    0      双侧颈部各动脉内径正常，内膜-中膜薄而平滑，连续性好，管腔内未见异常回声，彩色血流充盈良好，...   
    1      甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。 双侧颈总动脉管径对称，内...   
    2      各房室腔大小正常，主动脉主波波幅正常，重博波存在，室间隔，左室后壁无增厚，活动正常，未见节段...   
    3      双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 双侧颈总动脉形态结构正常，管壁不...   
    4      各房室腔大小正常，主动脉主波波形正常，重搏波存在，室间隔，左室后壁无增厚，活动正常，未见节段...   
    5                      甲状腺形态大小正常，腺体回声均匀，左叶可见大小约2x2mm低回声。   
    6      升主动脉内径：20mm     左房前后径：23mm    右室流出道：22mm      ...   
    7                                                    NaN   
    8      双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。左侧乳腺腺体层内见一低回声团，测值...   
    9         双侧乳腺轮廓清晰，层次清楚，腺体无增厚，分布均匀，腺管无扩张。CDFI：内未见明显异常血流。   
    10     双侧乳腺内可见一条状的低回声区，约25mm×7mm,回声分布不均匀，边界不清，腋下未探及淋巴...   
    11                                                   NaN   
    12     nan 双乳腺腺体层增厚，回声减低，乳晕周围导管扩张，呈管状无回声区，未见异常血流信号。双侧...   
    13             双侧乳房形态轮廓正常，层次尚清，部分腺体稍增厚，内部回声增强，结构紊乱，分布不均。   
    14     双侧乳房形态轮廓正常，层次尚清，部分腺体稍增厚，内部回声增强，结构紊乱，分布不均。 子宫体积...   
    15     双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常...   
    16       双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    17     盆腔未见子宫回声。双侧卵巢不清晰。 双侧乳房形态轮廓正常，层次尚清，部分腺体稍增厚，内部回声...   
    18     双侧甲状腺形态大小正常，于右侧内见多个低回声，最大约6mm×4mm，周边无血管环绕。左侧甲状...   
    19     子宫形态大小正常，可见多个低回声区，最大约29mm×29mm，位于后壁。双侧附件未见明显异常...   
    20     甲状腺形态大小正常，边界清晰，内部回声分布欠均匀。CDFI：血流显示未见异常。 双侧乳腺腺体...   
    21                                                   NaN   
    22                                                   NaN   
    23       双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    24     双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。左乳内上见椭圆形低回声区，大小约5...   
    25     双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    26     双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常...   
    27     双侧甲状腺大小形态正常，包膜光整，实质回声尚均匀，左侧见无回声，大小约3mmx1mm，其内见...   
    28                     甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    29     子宫后位，形态饱满，宫壁回声不均匀，其内可见多个异常回声团块，较大约15*15mm,宫内节育...   
    ...                                                  ...   
    38169  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。 右侧颈总动脉分叉处前壁见...   
    38170  双侧甲状腺形态大小正常，包膜完整，于右侧叶中上极见一类圆形囊性结节，大小约3*2.2mm，边...   
    38171  双侧颈部各动脉内径正常，内膜-中膜薄而平滑，连续性好管腔内未见异常回声，彩色血流充盈良好，频...   
    38172  描述心脏测值：二维及M型超声测值：AO:27 AAO:29 LA:32 LV(D):43 R...   
    38173  甲状腺形态大小正常，边界清晰，内部回声分布欠均匀。 子宫前位，形态大小正常，轮廓光整，实质回...   
    38174  子宫前位，子宫形态大小正常，轮廓光整，肌层回声均匀。宫颈见多个类圆形无回声区，直径约3mm，...   
    38175  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。 子宫后位，子宫形态大小正...   
    38176  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    38177                                                NaN   
    38178  子宫形态大小正常，轮廓光整，实质回声均匀，宫内节育器位置正常。子宫后壁可见两个低回声区，大者...   
    38179    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    38180  双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 甲状腺形态大小正常，边界清晰，内...   
    38181    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    38182  nan 双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 甲状腺大小形态正常，双叶...   
    38183     nan 甲状腺形态大小正常，左叶探及一个低回声结节，大小约7x6mm，边界清，未见血流信号。   
    38184  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    38185    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    38186                                                NaN   
    38187                  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    38188  双侧乳腺结构层次清晰，皮下及脂肪层未见异常，腺体内组织导管内径增宽，走形迂曲，呈"蜂窝状"低...   
    38189  双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 甲状腺形态大小正常，于右叶探及一...   
    38190  甲状腺形态大小正常，甲状腺双叶内见多个混合回声结节，右叶较大约11.6×6mm，左叶较大约7...   
    38191     子宫形态大小正常，轮廓光整，肌层回声均匀，宫颈见多个类圆形无回声区，最大约为8mmx4mm。   
    38192  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。右侧颈总膨大处动脉探及高回声斑块，大小约1...   
    38193    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    38194  双侧乳腺腺体层轻度增厚,内部结构稍紊乱,回声欠均匀，未见异常血流。 甲状腺形态大小正常，包膜...   
    38195          双侧甲状腺大小形态正常，腺体回声均匀，右叶内可探及大小约5×4mm无回声，边界清。   
    38196                                                NaN   
    38197  子宫前位，子宫体积缩小，轮廓光整，实质回声均匀，内膜不厚，未见明显异常回声。宫内节育器位置正...   
    38198  nan 甲状腺形态大小正常，左叶探及一低回声结节，大小约6x3mm，边界清，未见明显血流信号...   
    
                                                        0102  \
    0      甲状腺右叶结节甲状腺左叶囊实性结节,建议定期检查左侧颈部淋巴结肿大 肝、胆、胰、脾、左肾、右...   
    1      前列腺未发现明显异常 甲状腺彩超未发现明显异常 膀胱未发现明显异常 颈动脉彩超未发现明显异常...   
    2      心脏彩超未发现明显异常 胃粘膜层毛糙 肝:脂肪肝（中度）胆、胰、脾未发现明显异常 颈动脉彩超...   
    3      双乳腺彩超未发现明显异常 心脏彩超未发现明显异常 肝、胆、脾未发现明显异常 颈动脉彩超（双侧...   
    4      双侧乳腺轻度增生 双侧颈动脉内-中膜毛糙 心脏彩超未发现明显异常 甲状腺右叶结节 胆:胆囊壁...   
    5         肝、胆、脾未发现明显异常 甲状腺左叶结节 前列腺:前列腺钙化灶左肾、右肾、膀胱未发现明显异常   
    6      前列腺:前列腺钙化灶左肾、右肾、膀胱未发现明显异常 肝、胆、胰、脾未发现明显异常 心脏彩超未...   
    7        肝:脂肪肝（中度）胆、胰、脾、左肾、右肾未发现明显异常 前列腺:前列腺钙化灶膀胱未发现明显异常   
    8      左附件:多囊卵巢子宫、右附件未发现明显异常 肝、胆、胰、脾、左肾、右肾未发现明显异常 双侧乳...   
    9       胆囊壁毛糙胆总管增宽左肾:左肾囊肿左肾结石肝、胰、脾、右肾未发现明显异常 乳腺彩超未发现明显异常   
    10     肝、胆、胰、脾、左肾、右肾未发现明显异常 子宫:子宫肌层回声不均宫颈管分离右附件:右侧卵巢囊...   
    11                                                   NaN   
    12     哺乳期乳腺双侧乳腺轻度增生 左附件:左侧多囊卵巢右附件:右侧多囊卵巢子宫未发现明显异常 肝、...   
    13      肝:脂肪肝（中度）肝囊肿（多发）胆:胆囊结石右肾:右肾结晶胰、脾、左肾未发现明显异常 绝经期乳腺   
    14     膀胱、双侧输尿管未发现明显异常 肝:脂肪肝（轻度）胆:胆囊未探及（自述已切除）胰、脾、左肾、...   
    15     胆:胆囊结石肝、胰、脾、左肾、右肾未发现明显异常 甲状腺超声未发现明显异常 双侧乳腺小叶增生...   
    16     甲状腺超声未发现明显异常 前列腺:前列腺增大前列腺钙化灶 肝、胆、胰、脾、左肾、右肾未发现明显异常   
    17     子宫未探及（自述已切除）双侧卵巢不清晰 肝:脂肪肝趋势肝内高回声，考虑肝血管瘤胆、胰、脾、左...   
    18     肝、胆、胰、脾、左肾、右肾未发现明显异常 前列腺未发现明显异常 甲状腺右侧结节（多发）左侧甲...   
    19     子宫肌瘤(多发)左右侧附件未见异常。 甲状腺左叶结节右侧甲状腺未见异常 双侧乳腺轻度增生 胆...   
    20     绝经后子宫子宫肌瘤伴钙化双侧卵巢不清晰 甲状腺双叶回声欠均匀 双侧乳腺小叶增生 左侧颈总动脉...   
    21                       肝:脂肪肝（轻度）左肾:左肾结晶胆、胰、脾、右肾未发现明显异常   
    22                           肝:肝囊肿右肾:右肾结晶胆、胰、脾、左肾未发现明显异常   
    23      甲状腺超声未发现明显异常 胆:胆囊结石肝、胰、脾、右肾、左肾未发现明显异常 前列腺未发现明显异常   
    24     双侧乳腺小叶增生左侧乳腺结节 胆:胆囊结石肝、胰、脾、右肾、左肾未发现明显异常 阴超未发现明...   
    25     颈动脉彩超检查未发现明显异常 假体植入术后 甲状腺左叶结节 绝经后子宫子宫肌瘤双侧卵巢不清晰...   
    26     肝:脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 前列腺未发现明显异常 双侧甲状腺未见...   
    27                甲状腺左叶结节伴钙化 肝:脂肪肝（轻度）胆、胰、脾、右肾、左肾未发现明显异常   
    28     甲状腺超声未发现明显异常 前列腺未发现明显异常 肝:脂肪肝（中度）右肾:右肾结石（泥沙样）胆...   
    29     肝:肝内胆管结石左肾:左肾结石（泥沙样）右肾:右肾结石（泥沙样）胆、胰、脾未发现明显异常 子...   
    ...                                                  ...   
    38169  脂肪肝（轻度）胆囊结石（多发）胰、脾、左肾、右肾未发现明显异常 膀胱、前列腺、双侧输尿管未发...   
    38170  脂肪肝（中度）肝囊肿（多发）胆、胰、脾、左肾、右肾未发现明显异常 前列腺:前列腺增生膀胱、双...   
    38171  膀胱、前列腺、双侧输尿管未发现明显异常 双侧颈动脉超声未发现明显异常 肝:脂肪肝（轻度）肝内...   
    38172  胆囊息肉肝、胰、脾、右肾、左肾未发现明显异常 二尖瓣反流(轻度) 双侧颈动脉超声未发现明显异...   
    38173  肝、胆、胰、脾、左肾、右肾未发现明显异常 甲状腺双叶回声欠均匀 妇科彩超子宫附件（经腹）未发...   
    38174  宫颈囊肿（多发）盆腔积液 双侧乳腺结节（多发）左侧乳腺结节，考虑纤维腺瘤 肝、胆、胰、脾、左...   
    38175  肝、胆、胰、脾、左肾、右肾未发现明显异常 甲状腺彩超未发现明显异常 妇科彩超子宫附件（经腹）...   
    38176  脂肪肝（中度）左肾结石右肾:右肾结石右肾囊肿胆、胰、脾未发现明显异常 颈动脉彩超（双侧）未发...   
    38177                          脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常   
    38178   肝:脂肪肝趋势胆、胰、脾、左肾、右肾未发现明显异常 宫内节育器位置正常子宫肌瘤 双侧乳腺小叶增生   
    38179                   肝、胆、胰、脾、右肾、左肾未发现明显异常 双侧甲状腺未见明显异常   
    38180  乳腺彩超未发现明显异常 肝:脂肪肝趋势考虑慢性胆囊炎可能胰、脾、左肾、右肾未发现明显异常 甲...   
    38181       肝、胆、胰、脾、左肾、右肾未发现明显异常 甲状腺超声未发现明显异常 前列腺未发现明显异常   
    38182  乳腺彩超（无图文）未发现明显异常 甲状腺双叶结节（多发） 子宫:绝经后子宫左附件、右附件未发...   
    38183     肝:脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 前列腺未发现明显异常 甲状腺左叶结节   
    38184  颈动脉彩超检查未发现明显异常 甲状腺右叶结节 前列腺未发现明显异常 膀胱、双侧输尿管未发现明...   
    38185  彩超（双侧甲状腺）未发现明显异常 肝:脂肪肝胆、胰、脾未发现明显异常 右肾、左肾、膀胱、前列...   
    38186                                                NaN   
    38187  甲状腺超声未发现明显异常 肝:脂肪肝（轻度）右肾:右肾结石左肾:左肾双肾盂左肾结晶胆、胰、脾...   
    38188  脂肪肝趋势胆、胰、脾、左肾、右肾未发现明显异常 子宫、左附件、右附件未发现明显异常 双侧乳腺...   
    38189  子宫、左附件、右附件未发现明显异常 乳腺彩超（双侧）未发现明显异常 甲状腺右叶结节 肝、胆、...   
    38190  甲状腺双叶结节（多发） 前列腺:前列腺稍大前列腺囊肿左肾、右肾、双侧输尿管、膀胱未发现明显异...   
    38191               宫颈囊肿（多发） 肝:脂肪肝（中度）胆、胰、脾、左肾、右肾未发现明显异常   
    38192  肝、胆、胰、脾、左肾、右肾未发现明显异常 双侧颈总动脉斑块,建议复查 左心室舒张功能减低二尖...   
    38193  肝:脂肪肝（中度）肝囊肿胆、胰、脾、右肾、左肾未发现明显异常 甲状腺超声未发现明显异常 前列...   
    38194  肝:脂肪肝（轻度）肝内胆管结石左肾、右肾、胆、胰、脾未发现明显异常 双侧乳腺轻度增生 甲状腺...   
    38195     肝:脂肪肝（中度）左肾、右肾、胆、胰、脾未发现明显异常 前列腺未发现明显异常 甲状腺右叶结节   
    38196  膀胱:膀胱充盈欠佳前列腺未发现明显异常 肝:肝内钙化灶脂肪肝趋势胆:胆囊息肉可能胰、脾、右肾...   
    38197  乳腺彩超未发现明显异常 宫内节育器位置正常绝经后子宫 甲状腺彩超未发现明显异常 肝、胆、胰、...   
    38198  肝:脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 子宫:子宫肌瘤左附件、右附件未发现明...   
    
                                 ...                         979026  979027  \
    0                            ...                            NaN     NaN   
    1                            ...                            NaN     NaN   
    2                            ...                            NaN     NaN   
    3                            ...                            NaN     NaN   
    4                            ...                            NaN     NaN   
    5                            ...                            NaN     NaN   
    6                            ...                            NaN     NaN   
    7                            ...                            NaN     NaN   
    8                            ...                            NaN     NaN   
    9                            ...                            NaN     NaN   
    10                           ...                            NaN     NaN   
    11                           ...                            NaN     NaN   
    12                           ...                            NaN     NaN   
    13                           ...                            NaN     NaN   
    14                           ...                            NaN     NaN   
    15                           ...                            NaN     NaN   
    16                           ...                            NaN     NaN   
    17                           ...                            NaN     NaN   
    18                           ...                            NaN     NaN   
    19                           ...                            NaN     NaN   
    20                           ...                            NaN     NaN   
    21                           ...                            NaN     NaN   
    22                           ...                            NaN     NaN   
    23                           ...                            NaN     NaN   
    24                           ...                            NaN     NaN   
    25                           ...                            NaN     NaN   
    26                           ...                            NaN     NaN   
    27                           ...                            NaN     NaN   
    28                           ...                            NaN     NaN   
    29                           ...                            NaN     NaN   
    ...                          ...                            ...     ...   
    38169                        ...                            NaN     NaN   
    38170                        ...                            NaN     NaN   
    38171                        ...                            NaN     NaN   
    38172                        ...                            NaN     NaN   
    38173                        ...                            NaN     NaN   
    38174                        ...                            NaN     NaN   
    38175                        ...                            NaN     NaN   
    38176                        ...                            NaN     NaN   
    38177                        ...                            NaN     NaN   
    38178                        ...                            NaN     NaN   
    38179                        ...                            NaN     NaN   
    38180                        ...                            NaN     NaN   
    38181                        ...                            NaN     NaN   
    38182                        ...                            NaN     NaN   
    38183                        ...                            NaN     NaN   
    38184                        ...                            NaN     NaN   
    38185                        ...                            0.0     0.1   
    38186                        ...                            NaN     NaN   
    38187                        ...                            NaN     NaN   
    38188                        ...                            NaN     NaN   
    38189                        ...                            NaN     NaN   
    38190                        ...                            NaN     NaN   
    38191                        ...                            NaN     NaN   
    38192                        ...                            NaN     NaN   
    38193                        ...                            NaN     NaN   
    38194                        ...                            NaN     NaN   
    38195                        ...                            NaN     NaN   
    38196                        ...                            NaN     NaN   
    38197                        ...                            NaN     NaN   
    38198                        ...                            NaN     NaN   
    
                                                        A201  \
    0        两侧胸廓对称，两肺纹理增粗，右肺上叶见片絮状模糊影，并见有小圆形高密度影。边缘较清晰。余...   
    1      胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    2      胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    3      右上肺可见索条及钙化影 两侧大脑半球，小脑及脑干形态正常，未见明显异常密度病灶，两侧脑室，第...   
    4      颈椎生理曲线僵直。颈椎椎体及相应椎小关节骨质增生，颈椎间盘突出。 双肺下叶见索条影，双肺门不...   
    5      双肺见索条影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血管形态正常，纵隔内未见肿块及肿大淋巴...   
    6                                                    NaN   
    7                                                    NaN   
    8      胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    9                                                 详见纸质报告   
    10                                                   NaN   
    11     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    12     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    13                                                   NaN   
    14                                                   NaN   
    15                                                   NaN   
    16     两侧胸廓对称。肺窗示两肺纹理清晰，走行自然，左肺上叶舌段及右肺下叶见少许纤维灶。两侧肺门不大...   
    17                                                   NaN   
    18                                                   NaN   
    19                                                   NaN   
    20     两侧胸廓对称。肺窗示右肺上叶（image 8）见微小结节灶，直径约 3mm，边界清，右肺上叶...   
    21                                                   NaN   
    22                                                   NaN   
    23     胸廓对称，双肺纹理清晰，走行自然，右上肺大泡，双肺门不大。纵隔窗示纵隔无偏移，心影及大血管形...   
    24                                                   NaN   
    25     颈椎椎体序列正常，生理曲度变直，C4/5椎间盘向后突出压迫脊髓，C3/4、C5/6、C6/7...   
    26                                                   NaN   
    27                                                   NaN   
    28                                                   NaN   
    29                                                   NaN   
    ...                                                  ...   
    38169      双侧大脑半球对称，灰白质对比正常，未见局灶性密度异常，各脑室、脑池大小、形态均正常，...   
    38170      右侧基底节区可见斑片状低密度影，无明显占位效应，余脑实质内未见异常密度影，各脑室、脑...   
    38171  两侧胸廓对称。肺窗示两肺纹理清晰，走行自然，未见明显异常密度影。气管旁见一小含气腔隙。两侧肺...   
    38172  两侧胸廓对称。肺窗示两肺纹理无明显增多增密，右肺下叶见局限性斑片状低密度区，透亮度增高。两肺...   
    38173  双侧肺内未见异常密度影，肺血管走行正常，各叶、段支气管通畅；肺门影不大。纵隔内淋巴结不大。心...   
    38174  检查所见:右肺中叶可见一小结节状稍高密度影，边界稍模糊，直径约4mm，余肺内未见异常密度影，...   
    38175  检查所见:右肺上叶胸膜下可见一结节状稍高密度影，边界稍模糊，直径约4mm，余肺内未见异常密度...   
    38176                                           结论详见报告单。   
    38177                                                NaN   
    38178  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    38179                                                NaN   
    38180  左肺上叶前段、舌段及右肺上叶后段胸膜下见多发斑片状密度增高影，边界清晰；余肺内未见异常密度影...   
    38181                                         详见纸质报告 nan   
    38182  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    38183                                                NaN   
    38184                                                NaN   
    38185  肝脏大小、形态正常，实质内未见异常密度影，肝内、外胆管未见扩张，胆囊大小正常，囊内未见明显阳...   
    38186                                                NaN   
    38187  两侧胸廓对称。肺窗示左肺下叶（image 32）见微小结节灶，直径约 4mm；左肺下叶见结节...   
    38188                                                NaN   
    38189  腰椎生理曲度变直，诸椎体骨质边缘未见明显增生，诸椎间隙显示尚可，L4/5椎间盘向四周膨出，硬...   
    38190                                                NaN   
    38191                                                NaN   
    38192  定位片示腰椎生理曲度变直，椎体前后缘毛糙、变尖，L3-4、L4-5椎间隙变窄，横断面示L3-...   
    38193                                      详见纸质报告 详见纸质报告   
    38194                                                NaN   
    38195  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    38196  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    38197  检查所见:双肺下叶及右肺中叶支气管可见扩张，呈柱状改变，周围可见渗出，余肺内未见异常密度影，...   
    38198                                                NaN   
    
                                                        A202  \
    0                                            炎性病变可能右肺钙化灶   
    1                                          肺部CT扫描未发现明显异常   
    2                                       肺部CT（不出片）未发现明显异常   
    3                                陈旧性肺结核 头部CT（不出片）未发现明显异常   
    4                                             肺陈旧性病变 颈椎病   
    5                                                 肺陈旧性病变   
    6                                                    NaN   
    7                                                    NaN   
    8                                            CT胸部未发现明显异常   
    9                                                 详见纸质报告   
    10                                                   NaN   
    11                                           CT胸部未发现明显异常   
    12                                           CT胸部未发现明显异常   
    13                                                   NaN   
    14                                                   NaN   
    15                                                   NaN   
    16                         1.左肺上叶舌段及右肺下叶少许纤维灶。2.主动脉管壁钙化。   
    17                                                   NaN   
    18                                                   NaN   
    19                                                   NaN   
    20     1.右肺上叶微结节灶。2.右肺上叶少许炎症可能，建议结合临床随访。3.两肺下叶少许纤维灶，右...   
    21                                                   NaN   
    22                                                   NaN   
    23                                                   肺大泡   
    24                                                   NaN   
    25                                   促销项目2未发现明显异常 颈椎间盘突出   
    26                                                   NaN   
    27                                                   NaN   
    28                                                   NaN   
    29                                                   NaN   
    ...                                                  ...   
    38169                                   颅脑CT(不出片）未发现明显异常   
    38170                                       右侧基底节区腔隙性脑梗塞   
    38171  1.两肺CT平扫未见明显异常；2.气管旁憩室；3.左侧胸膜微结节灶；4.脂肪肝；5.胆囊未见...   
    38172                                      右肺下叶局限性肺气肿改变。   
    38173                                        胸部CT平扫未见异常。   
    38174                                     右肺中叶结节？建议随访复查。   
    38175                                 右肺上叶胸膜下小结节，建议随访复查。   
    38176                                           结论详见报告单。   
    38177                                                NaN   
    38178                                     放射2（胸肺）未发现明显异常   
    38179                                                NaN   
    38180                             1、考虑双肺上叶局灶性纤维化。2、胸椎退变。   
    38181                             详见纸质报告 CT检查(腰部)未发现明显异常   
    38182                                              肝内钙化灶   
    38183                                                NaN   
    38184                                                NaN   
    38185                                   上腹部CT体层扫描未发现明显异常   
    38186                                                NaN   
    38187                   1.左肺下叶微结节灶可能大，建议短期复查。2.左肺下叶结节钙化灶   
    38188                                                NaN   
    38189                                       腰椎间盘膨出腰椎间盘突出   
    38190                                                NaN   
    38191                                                NaN   
    38192                1．腰椎退行性变。2．L3-4、L4-5、L5-S1椎间盘膨出伴变性。   
    38193                                      详见纸质报告 详见纸质报告   
    38194                                                NaN   
    38195                                   肺部CT（不出片）未发现明显异常   
    38196                                   CT-(T)肺部6未发现明显异常   
    38197                                 双肺下叶及右肺中叶支气管扩张并感染。   
    38198                                                NaN   
    
                                                        A301  \
    0      双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    1                                                    NaN   
    2                                                    NaN   
    3                                                    NaN   
    4                                                    NaN   
    5                                                    NaN   
    6                                                    NaN   
    7                                                    NaN   
    8                                                    NaN   
    9                                                    NaN   
    10                                                   NaN   
    11                                                   NaN   
    12                                                   NaN   
    13                                                   NaN   
    14                                                   NaN   
    15                                                   NaN   
    16                                                   NaN   
    17                                                   NaN   
    18                                                   NaN   
    19                                                   NaN   
    20                                                   NaN   
    21                                                   NaN   
    22                                                   NaN   
    23                                                   NaN   
    24                                                   NaN   
    25     矢状面示腰骶椎生理曲度正常，椎体形态及信号均正常，椎间隙正常，椎间盘T1WI等信号，T2WI...   
    26                                                   NaN   
    27                                                   NaN   
    28                                                   NaN   
    29                                                   NaN   
    ...                                                  ...   
    38169                                                NaN   
    38170                                                NaN   
    38171  左侧颞叶、双侧额、顶叶及基底节区见多发点状异常信号病灶，T1WI略低信号，T2WI高信号，F...   
    38172  两侧大脑实质、小脑及脑干形态、大小正常，其内未见异常信号。各脑池及脑室未见扩大和闭塞。脑沟脑...   
    38173                                                NaN   
    38174                                                NaN   
    38175                                                NaN   
    38176                                                NaN   
    38177                                                NaN   
    38178                                                NaN   
    38179                                                NaN   
    38180                                                NaN   
    38181                                                NaN   
    38182                                                NaN   
    38183                                                NaN   
    38184                                                NaN   
    38185  双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    38186                                                NaN   
    38187                                                NaN   
    38188                                                NaN   
    38189  双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    38190                                                NaN   
    38191                                                NaN   
    38192                                                NaN   
    38193                                                NaN   
    38194                                                NaN   
    38195                                                NaN   
    38196  双侧额叶皮层下、侧脑室旁、半卵圆中心、基底节区、左侧丘脑可见多数斑点状、晕状等长T1长T2信...   
    38197                                                NaN   
    38198                                                NaN   
    
                                             A302                  A601 A701 A703  \
    0                                头部MRI未发现明显异常           具体内容请见分析报告。  4.8  229   
    1                                         NaN           具体内容请见分析报告。  7.1  315   
    2                                         NaN                   NaN  NaN  NaN   
    3                                         NaN                   NaN  NaN  NaN   
    4                                         NaN                   NaN  NaN  NaN   
    5                                         NaN                   NaN  NaN  NaN   
    6                                         NaN  详见纸质报告 详见纸质报告 详见纸质报告  NaN  NaN   
    7                                         NaN                   NaN  NaN  NaN   
    8                                         NaN                   NaN  NaN  NaN   
    9                                         NaN                   NaN  NaN  NaN   
    10                                        NaN                   NaN  NaN  NaN   
    11                                        NaN                   NaN  NaN  NaN   
    12                                        NaN                   NaN  NaN  NaN   
    13                                        NaN                   NaN  NaN  NaN   
    14                                        NaN                   NaN  NaN  NaN   
    15                                        NaN                   NaN  NaN  NaN   
    16                                        NaN                   NaN  NaN  NaN   
    17                                        NaN                   NaN  NaN  NaN   
    18                                        NaN                   NaN  NaN  NaN   
    19                                        NaN                   NaN  NaN  NaN   
    20                                        NaN                   NaN  NaN  NaN   
    21                                        NaN                   NaN  NaN  NaN   
    22                                        NaN                   NaN  NaN  NaN   
    23                                        NaN                   NaN  4.3  230   
    24                                        NaN                   NaN  NaN  NaN   
    25                促销项目11未发现明显异常 促销项目14未发现明显异常                详见纸质报告  3.4  182   
    26                                        NaN                   NaN  NaN  NaN   
    27                                        NaN                   NaN  NaN  NaN   
    28                                        NaN                   NaN  NaN  NaN   
    29                                        NaN                   NaN  NaN  NaN   
    ...                                       ...                   ...  ...  ...   
    38169                                     NaN                   NaN  NaN  NaN   
    38170                                     NaN                   NaN  NaN  NaN   
    38171       1.左侧颞叶、双侧额、顶叶及基底节区散在缺血灶；2.轻度副鼻窦炎。                   NaN  5.4  265   
    38172  1.头颅MRI平扫示颅内未见明显异常。2.双侧上颌窦粘膜增厚，考虑轻度炎症。                详见纸质报告  5.4  252   
    38173                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38174                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38175                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38176                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38177                                     NaN                详见纸质报告  NaN  NaN   
    38178                                     NaN                   NaN  NaN  NaN   
    38179                                     NaN                   NaN  NaN  NaN   
    38180                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38181                                     NaN                   NaN  NaN  NaN   
    38182                                     NaN                   NaN  NaN  NaN   
    38183                                     NaN                   NaN  NaN  NaN   
    38184                                     NaN                   NaN  NaN  NaN   
    38185                         颅脑核磁共振成像未发现明显异常                   NaN  NaN  NaN   
    38186                                     NaN                   NaN  NaN  NaN   
    38187                                     NaN                   NaN  NaN  NaN   
    38188                                     NaN                   NaN  NaN  NaN   
    38189                             头颅核磁未发现明显异常                   NaN  NaN  NaN   
    38190                                     NaN                   NaN  NaN  NaN   
    38191                                     NaN                详见纸质报告  NaN  NaN   
    38192                                     NaN                   NaN  NaN  NaN   
    38193                                     NaN                   NaN  NaN  NaN   
    38194                                     NaN                   NaN  NaN  NaN   
    38195                                     NaN                   NaN  NaN  NaN   
    38196                       脑内多发缺血梗塞灶脑白质脱髓鞘改变                   NaN  NaN  NaN   
    38197                                     NaN         详见纸质报告 详见纸质报告  NaN  NaN   
    38198                                     NaN                   NaN  NaN  NaN   
    
                                                        A705  
    0                                           数字化肝超未发现明显异常  
    1                                脂肪衰减值大于240，肝脏脂肪含量超过正常值。  
    2                                                    NaN  
    3                                                    NaN  
    4                                                    NaN  
    5                                                    NaN  
    6                                                    NaN  
    7                                                    NaN  
    8                                                    NaN  
    9                                                    NaN  
    10                                                   NaN  
    11                                                   NaN  
    12                                                   NaN  
    13                                                   NaN  
    14                                                   NaN  
    15                                                   NaN  
    16                                                   NaN  
    17                                                   NaN  
    18                                                   NaN  
    19                                                   NaN  
    20                                                   NaN  
    21                                                   NaN  
    22                                                   NaN  
    23                                          数字化肝超未发现明显异常  
    24                                                   NaN  
    25                                          数字化肝超未发现明显异常  
    26                                                   NaN  
    27                                                   NaN  
    28                                                   NaN  
    29                                                   NaN  
    ...                                                  ...  
    38169                                                NaN  
    38170                                                NaN  
    38171  脂肪衰减值大于240，肝脏脂肪含量超过正常值。脂肪衰减值越大，肝脏脂肪含量越高，提示脂肪肝倾...  
    38172  脂肪衰减值大于240，肝脏脂肪含量超过正常值。脂肪衰减值越大，肝脏脂肪含量越高，提示脂肪肝倾...  
    38173                                                NaN  
    38174                                                NaN  
    38175                                                NaN  
    38176                                                NaN  
    38177                                                NaN  
    38178                                                NaN  
    38179                                                NaN  
    38180                                                NaN  
    38181                                                NaN  
    38182                                                NaN  
    38183                                                NaN  
    38184                                                NaN  
    38185                                                NaN  
    38186                                                NaN  
    38187                                                NaN  
    38188                                                NaN  
    38189                                                NaN  
    38190                                                NaN  
    38191                                                NaN  
    38192                                                NaN  
    38193                                                NaN  
    38194                                                NaN  
    38195                                                NaN  
    38196                                                NaN  
    38197                                                NaN  
    38198                                                NaN  
    
    [38199 rows x 409 columns]>
    """
    # print test_data.info
    """
        <bound method DataFrame.info of                                    vid  收缩压  舒张压  血清甘油三酯  血清高密度脂蛋白  血清低密度脂蛋白  \
    0     c643a744e2e94f3ff354d920958bd37b  NaN  NaN     NaN       NaN       NaN   
    1     a81c1fc0cfa8c0fbc450d2ffeae14b9f  NaN  NaN     NaN       NaN       NaN   
    2     2af0da8f6f0b8d642f88b3a8194408b6  NaN  NaN     NaN       NaN       NaN   
    3     2bd361a4c5b9b0d5aab62c101daa4ee6  NaN  NaN     NaN       NaN       NaN   
    4     16107e514ed0f51c4e39b1a0fa5a04f9  NaN  NaN     NaN       NaN       NaN   
    5     3e44d83fe827ec930c56921efd7d91c9  NaN  NaN     NaN       NaN       NaN   
    6     5252eedd84ae34f02e3f64d0e4c7cd25  NaN  NaN     NaN       NaN       NaN   
    7     92522ca0ceacd8ac8cb745c9a2b05d85  NaN  NaN     NaN       NaN       NaN   
    8     ceffa608d98e2a863726d5514ed48b62  NaN  NaN     NaN       NaN       NaN   
    9     86218415b3f842014f7138660ba520e2  NaN  NaN     NaN       NaN       NaN   
    10    8642e49b730a4e36420b92b1c9c453a3  NaN  NaN     NaN       NaN       NaN   
    11    998d5caea9c9ef785e5db3c18235ffb3  NaN  NaN     NaN       NaN       NaN   
    12    b2bce4ee542ddd713023e51f97d882ef  NaN  NaN     NaN       NaN       NaN   
    13    73a3b775ad00919cf54d93d1889d8549  NaN  NaN     NaN       NaN       NaN   
    14    ff3e629a853bd11e70b4ead6cfcc9a12  NaN  NaN     NaN       NaN       NaN   
    15    9c8457e7eb2097c82ebded4a85dd0491  NaN  NaN     NaN       NaN       NaN   
    16    2db6157abb07bfcebce85a05827a02d1  NaN  NaN     NaN       NaN       NaN   
    17    10f054c648f7cbe243f7a4fbc799bf89  NaN  NaN     NaN       NaN       NaN   
    18    e1e4e9927915b406554c2d1efb957d0c  NaN  NaN     NaN       NaN       NaN   
    19    5382220d19455724bf3e3fe70c0e2a7b  NaN  NaN     NaN       NaN       NaN   
    20    45412a7965d454e84e4394f021d7c761  NaN  NaN     NaN       NaN       NaN   
    21    0529a2063ca58f5021efbfd3ca686d3f  NaN  NaN     NaN       NaN       NaN   
    22    13a4fcdaae642a3055f86681923f76fb  NaN  NaN     NaN       NaN       NaN   
    23    92e542bc88fff242c70ef9bdf075f628  NaN  NaN     NaN       NaN       NaN   
    24    e338215f0dc6df774ff9bc2aa057f02d  NaN  NaN     NaN       NaN       NaN   
    25    2dd3712c7a621cc752c41c260d17befe  NaN  NaN     NaN       NaN       NaN   
    26    80abe4079c61b9ec5a0929cc97e5a2a6  NaN  NaN     NaN       NaN       NaN   
    27    1e567095c7f4826f0340f511feff273d  NaN  NaN     NaN       NaN       NaN   
    28    519a4559599e1dd55abd69f78eb84ab1  NaN  NaN     NaN       NaN       NaN   
    29    6d8a47b48d0df9d979e54ac337b2a94f  NaN  NaN     NaN       NaN       NaN   
    ...                                ...  ...  ...     ...       ...       ...   
    9508  422d9d526a188140fe764f098ba7d186  NaN  NaN     NaN       NaN       NaN   
    9509  8e8715dbbd9598bb7f3388f9d90e2fb7  NaN  NaN     NaN       NaN       NaN   
    9510  a6c969a681ba8ce3372f7905c90ab723  NaN  NaN     NaN       NaN       NaN   
    9511  75421322480afb27315e5a79d44e2207  NaN  NaN     NaN       NaN       NaN   
    9512  a4eebb64437e441832ac452040840a2a  NaN  NaN     NaN       NaN       NaN   
    9513  dec455350db6f093dcfa0aaa605af56a  NaN  NaN     NaN       NaN       NaN   
    9514  23a4ef7a90de3eceb31ba26eaee7489e  NaN  NaN     NaN       NaN       NaN   
    9515  b1366a122ff0d51e4938638bbce51764  NaN  NaN     NaN       NaN       NaN   
    9516  f3d2399efb877bee0879a46f5a8e63f5  NaN  NaN     NaN       NaN       NaN   
    9517  c1044a11b075cb6e18279e63729b75d7  NaN  NaN     NaN       NaN       NaN   
    9518  1ab1d15539ef2fa2600916bd01c80643  NaN  NaN     NaN       NaN       NaN   
    9519  fd888be234e89388b5a0cf70f99c1d4e  NaN  NaN     NaN       NaN       NaN   
    9520  6e0272a2546e214dbb9968cb77adf3ad  NaN  NaN     NaN       NaN       NaN   
    9521  9e2bfa3e32a33c207703e6f63609cb49  NaN  NaN     NaN       NaN       NaN   
    9522  ea9363009a4401f35cd0ac93acbf5a0d  NaN  NaN     NaN       NaN       NaN   
    9523  18cd3d1e625b2eb25b4caa53ca91b9ed  NaN  NaN     NaN       NaN       NaN   
    9524  11985662fc9579bf5a9ce5dd44e41656  NaN  NaN     NaN       NaN       NaN   
    9525  2d9f51bc2a37487410f514f25ab35644  NaN  NaN     NaN       NaN       NaN   
    9526  adafc2fe909d956c8a5f0b93b587f2ff  NaN  NaN     NaN       NaN       NaN   
    9527  62cb9fb02f44b7ca432bd8c3d0f66af7  NaN  NaN     NaN       NaN       NaN   
    9528  f02e2c0a6b234fe6682ac0bbf808b1db  NaN  NaN     NaN       NaN       NaN   
    9529  2b7b7c7a89211b337564b77683a64dc7  NaN  NaN     NaN       NaN       NaN   
    9530  4d157c1743a7461784bf91b7d0b943f4  NaN  NaN     NaN       NaN       NaN   
    9531  bf2380e1c86e3c04417fb7998ddf078b  NaN  NaN     NaN       NaN       NaN   
    9532  2978590858449a8c5bd0ab54f46f85a1  NaN  NaN     NaN       NaN       NaN   
    9533  9681bbfeba21876af02a91a598c58a9e  NaN  NaN     NaN       NaN       NaN   
    9534  a6dd5004441abc5b8196d0a0afc76aee  NaN  NaN     NaN       NaN       NaN   
    9535  1998ce6d7bd38d2bf0c530f35cb2650f  NaN  NaN     NaN       NaN       NaN   
    9536  cc4b0ce3c1b8e08a933a2e0ede1cd09d  NaN  NaN     NaN       NaN       NaN   
    9537  cd72865878e7144326a4d33d163665a2  NaN  NaN     NaN       NaN       NaN   
    
          Unnamed: 0  004997                                               0101  \
    0          44507     NaN  甲状腺大小正常，被膜光滑，余实质回声均匀。CDFI：腺体内血流分布正常。于甲状腺左叶可见大小...   
    1          37840     NaN                  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    2           9746     NaN  nan 双乳腺腺组织萎缩，分布均匀，腺管无扩张。CDFI：内未见明显异常血流。右侧乳腺腺体层...   
    3           9951     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    4           4953   17.49                                                NaN   
    5          14115   18.50  双侧甲状腺大小形态正常，实质回声增粗，分布不均，于左侧内见多个低回声，最大约6mm×5mm，...   
    6          18617     NaN                                                NaN   
    7          32955     NaN  双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 各房室腔大小正常，房室间隔连续完...   
    8          46468     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    9          30262     NaN  双侧颈总动脉形态结构正常,管壁不厚,内-中膜光滑,血管腔内径正常,其内未见异常回声。彩色多普...   
    10         30290     NaN  甲状腺轮廓清，被膜光滑，实质回声均匀，未见明确局限性异常回声。CDFI：甲状腺内血流分布未见异常。   
    11         34553     NaN                                                NaN   
    12         40090     NaN  甲状腺轮廓清，被膜光滑，实质回声均匀，未见明确局限性异常回声。CDFI：甲状腺内血流分布及频...   
    13         26063     NaN  双侧甲状腺大小形态正常，腺体回声均匀，右叶内可探及两个低回声，较大的大小约5×3mm，边界清...   
    14         57113   10.95  甲状腺轮廓清，被膜光滑，实质回声均匀，未见明确局限性异常回声。CDFI：甲状腺内血流分布及频...   
    15         35213     NaN  双侧甲状腺大小形态正常，包膜尚完整，实质回声增粗，分布不均，未见明显结节。CDFI：未见明显...   
    16         10379     NaN  双侧甲状腺大小形态正常，包膜尚完整，分布欠均匀，右叶见直径约5mm无回声，界清，规则，无明显...   
    17          3810     NaN     双侧乳腺轮廓清晰，层次清楚，腺体无增厚，分布均匀，腺管无扩张。CDFI：内未见明显异常血流。   
    18         50554     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    19         18898     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    20         15652     NaN  各房室腔大小正常，主动脉主波波形正常，重搏波存在，室间隔，左室后壁无增厚，活动正常，未见节段...   
    21          1144     NaN                  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    22          4422   15.42  双侧甲状腺大小形态正常，包膜尚完整，分布欠均匀，左叶/右叶见大小分别约5x3mm/6x4mm...   
    23         33094     NaN                  双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。   
    24         50853     NaN  甲状腺形态大小正常，边界清晰，内部回声分布不均匀。于右侧叶中极可见大小约5.6x3.2mm低...   
    25         10407   10.03  主动脉根部内径26mm，左房前后径36mm，室间隔舒张期厚径12mm，左室后壁厚9mm，左室...   
    26         29068     NaN  双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常...   
    27          6872     NaN                  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    28         18443     NaN                                                NaN   
    29         24704   12.36  双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 甲状腺形态大小正常，边界清晰，内...   
    ...          ...     ...                                                ...   
    9508       15000     NaN  双侧乳腺腺体层轻度增厚,内部结构稍紊乱,回声欠均匀，未见异常血流。 双侧甲状腺大小形态正常，...   
    9509       32090     NaN  双侧乳腺层次结构清晰，内部回声分布均匀，腺体内组织导管内径未见增宽，左侧乳腺腺体一点钟方向象...   
    9510       37550     NaN  双侧甲状腺形态大小正常，甲状腺左叶内可见一个囊性区，大小约1.8*1.4mm，边界光整，其内...   
    9511       26449     NaN                                                NaN   
    9512       37144     NaN    双侧颈动脉管径大致对称，右侧颈总动脉内中膜局部增厚，较厚处约1.1mm，余颈动脉未见明显异常。   
    9513       49883     NaN   双侧甲状腺大小形态正常，包膜光整，实质回声欠均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    9514        8151     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    9515       39759     NaN  甲状腺形态大小正常，于右叶探及一枚结节，大小约4x3mm，边界清，CDFI：未见明显异常血流...   
    9516       54588     NaN  子宫体积缩小，轮廓光整，实质回声均匀，内膜不厚，未见明显异常回声。双侧附件未见明显异常。 双...   
    9517       43314     NaN  双侧颈部各动脉内径正常，内膜-中膜薄而平滑，连续性好管腔内未见异常回声，彩色血流充盈良好，频...   
    9518        6008     NaN  甲状腺右叶形态大小正常，甲状腺左叶见一类圆形囊实性回声区，大小约7x3mm，形态尚规则，边界...   
    9519       56730     NaN  双侧乳腺结构层次清晰，皮下及脂肪层未见异常，腺体层不厚、回声粗糙,呈高低网络状改变，内未见明...   
    9520       24802     NaN  甲状腺形态大小正常，左叶内见一个无回声结节，大小约3*2mm。 双侧乳腺腺体层轻度增厚,内部...   
    9521       35610     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    9522       52502     NaN  双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。右侧乳腺腺体层内见多个低回声区，大...   
    9523        5570     NaN  室间隔厚         10mm       升主动脉内径  28mm左房前后径     ...   
    9524        3948    7.75  双侧乳腺腺体层增厚,内部结构紊乱,回声不均，未见异常血流。左腋下可见20mmx8mm高回声区...   
    9525       10357     NaN        甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声，CDFI：未见异常。   
    9526       38997     NaN    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    9527       22308     NaN    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    9528       53737     NaN  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。 双侧颈总动脉管径对称，内...   
    9529        9867     NaN  双侧甲状腺形态大小正常，于甲状腺右叶可见一个低回声结节，大小约5mm×4mm，结节周边无血管...   
    9530       17433     NaN  右侧颈总动脉分叉处后壁见大小约4.7*1.6mm低回声斑块，余动脉未见异常，CDFI:以上动...   
    9531       42864     NaN                  甲状腺形态大小正常，边界清晰，内部回声分布均匀，未见明显异常回声。   
    9532        9410     NaN    双侧甲状腺大小形态正常，包膜光整，实质回声均匀，未见明显异常回声。CDFI：血流显示未见异常。   
    9533       33823     NaN  右侧颈总动脉探及一强回声斑块，大小约3x2mm。左侧颈总动脉探及一强回声斑块，大小约3x3m...   
    9534       37560     NaN  双侧颈总动脉管径对称，内中膜不增厚,血流速度正常。双侧颈总动脉分叉处管径对称，内中膜不增厚，...   
    9535        5749     NaN                                                NaN   
    9536       45870     NaN  双侧乳腺层次结构清晰，内部回声分布均匀，未见明显异常回声。 甲状腺形态大小正常，边界清晰，内...   
    9537       46141     NaN  nan 甲状腺形态大小正常，边界清晰，内部回声分布欠均匀。左叶探及多个低回声结节，大者约8....   
    
                                                       0102  \
    0     甲状腺左叶结节（多发） 双侧颈总动脉斑块右侧锁骨下动脉斑块 左侧乳腺结节,建议定期检查 左心...   
    1     甲状腺彩超（双侧）未发现明显异常 左肾、右肾、膀胱、前列腺未发现明显异常 肝:脂肪肝（轻度）...   
    2     肝、胆、胰、脾、左肾、右肾未发现明显异常 子宫:绝经后子宫子宫肌瘤左附件:左侧卵巢囊肿右附件...   
    3     甲状腺左侧结节右侧甲状腺未见异常 颈动脉彩超检查未发现明显异常 前列腺未发现明显异常 肝:脂...   
    4     膀胱:膀胱壁增厚毛糙双侧输尿管未发现明显异常 肝:脂肪肝（轻度）胆:胆囊结石（充满型）左肾:...   
    5     肝:脂肪肝（轻度）右肾:右肾结晶胆、胰、脾、左肾未发现明显异常 前列腺未发现明显异常 甲状腺...   
    6                       前列腺未发现明显异常 肝、胆、胰、脾、左肾、右肾未发现明显异常   
    7     子宫、左附件、右附件未发现明显异常 心脏彩超不出图未发现明显异常 甲状腺右叶结节 肝:脂肪肝...   
    8     双乳腺彩超未发现明显异常 颈动脉彩超（双侧）未发现明显异常 甲状腺彩超（双侧）未发现明显异常...   
    9     心脏彩超未发现明显异常 颈动脉彩超（双侧）未发现明显异常 肝:脂肪肝趋势胆、胰、脾未发现明显...   
    10    肝:脂肪肝（轻度）肝内钙化灶胆:胆囊息肉（多发）胰、脾、左肾、右肾未发现明显异常 甲状腺彩超...   
    11                      前列腺:前列腺钙化灶 肝、胆、胰、脾、左肾、右肾未发现明显异常   
    12    肝:脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 甲状腺超声未发现明显异常 前列腺:前...   
    13    右肾:右肾结石左肾:左肾未探及（自述已切除）前列腺:前列腺回声不均膀胱未发现明显异常 肝、胆...   
    14    肝:脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 前列腺:前列腺钙化灶 甲状腺彩超（双...   
    15    双侧乳腺小叶增生 甲状腺弥漫性回声异常 宫颈囊肿子宫肌瘤 肝:肝内钙化灶胆、胰、脾、左肾、右...   
    16     胆囊结石肝、胰、脾未发现明显异常 甲状腺右叶结节 前列腺稍大并钙化右肾、左肾、膀胱未发现明显异常   
    17    子宫:盆腔积液左附件、右附件未发现明显异常 肝、胆、胰、脾、左肾、右肾未发现明显异常 乳腺彩...   
    18    前列腺:前列腺钙化灶 肝:脂肪肝（轻度）胆、胰、脾、右肾、左肾未发现明显异常 颈动脉彩超检查...   
    19    子宫、左附件、右附件未发现明显异常 颈动脉彩超未发现明显异常 甲状腺双叶结节 膀胱未发现明显...   
    20    二尖瓣反流(轻度)三尖瓣反流(轻度) 子宫:盆腔积液左肾、右肾、膀胱、左附件、右附件未发现明...   
    21    (双侧)甲状腺彩超不出图未发现明显异常 肝:脂肪肝（中度）胆、胰、脾、左肾、右肾未发现明显异...   
    22    左肾、右肾、膀胱、前列腺未发现明显异常 甲状腺双叶结节 脂肪肝（轻度）胆囊息肉脾脏增大,请结...   
    23    (双侧)甲状腺彩超不出图未发现明显异常 肝:脂肪肝（中度）胆、胰、脾、左肾、右肾未发现明显异...   
    24    肝:脂肪肝（中度）肝血管瘤胆、胰、脾、右肾、左肾未发现明显异常 子宫、左附件、右附件未发现明...   
    25    膀胱未发现明显异常 肝、胆、胰、脾、左肾、右肾未发现明显异常 前列腺未发现明显异常 心脏彩超...   
    26    双侧乳腺小叶增生 肝、胆、胰、脾、左肾、右肾未发现明显异常 甲状腺超声未发现明显异常 阴超未...   
    27    左肾、右肾、膀胱、前列腺未发现明显异常 甲状腺彩超（双侧）未发现明显异常 肝:脂肪肝（中度）...   
    28                          肝:脂肪肝（轻度）胆、胰、脾、右肾、左肾未发现明显异常   
    29    肝、胆、胰、脾未发现明显异常 左肾、右肾、膀胱未发现明显异常 双乳腺彩超未发现明显异常 甲状...   
    ...                                                 ...   
    9508  子宫、左附件、右附件未发现明显异常 双侧乳腺轻度增生 脾:脾脏增厚肝、胆、胰、右肾、左肾未发...   
    9509  肝、胆、胰、脾、左肾、右肾未发现明显异常 子宫:子宫未探及（自述已切除）左附件、右附件未发现...   
    9510  甲状腺左叶囊性结节 前列腺:前列腺稍大并钙化 肝:脂肪肝趋势胆:胆囊息肉（多发）胰、脾、左肾...   
    9511                                                NaN   
    9512  右侧颈总动脉内中膜局部增厚 肝:脂肪肝（轻度）肝内钙化灶胆、胰、脾、左肾、右肾未发现明显异常...   
    9513  肝:脂肪肝（轻度）胆:胆囊壁胆固醇结晶胰、脾未发现明显异常 彩超（双侧甲状腺）未发现明显异常...   
    9514         肝、胆、胰、脾、左肾、右肾未发现明显异常 颈动脉彩超检查未发现明显异常 前列腺钙化灶   
    9515  左肾:左肾囊肿肝、胆、胰、脾、右肾未发现明显异常 甲状腺右叶结节 乳腺彩超（双侧）未发现明显...   
    9516   绝经后子宫 甲状腺超声未发现明显异常 肝、胆、胰、脾、左肾、右肾未发现明显异常 双侧乳腺小叶增生   
    9517  双侧颈动脉超声未发现明显异常 胆囊息肉左肾:左肾囊肿肝、胰、脾、右肾未发现明显异常 甲状腺超...   
    9518  膀胱:膀胱充盈欠佳右肾、左肾、双侧输尿管未发现明显异常 前列腺:前列腺稍大并钙化 肝、胆、胰...   
    9519  脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 子宫、左附件、右附件未发现明显异常 双侧...   
    9520  颈动脉彩超（双侧）未发现明显异常 甲状腺左叶结节 双侧乳腺轻度增生右侧乳腺结节（多发）,建议...   
    9521  肝:脂肪肝（中度）胆、胰、脾、左肾、右肾未发现明显异常 颈动脉彩超（双侧）（无图文）未发现明...   
    9522  右肾:右肾结石肝、胆、胰、脾、左肾未发现明显异常 绝经后子宫子宫肌瘤(多发) 双侧乳腺小叶增...   
    9523  心脏彩超未发现明显异常 颈动脉彩超（双侧）未发现明显异常 甲状腺右叶结节 胆:胆囊壁毛糙左肾...   
    9524  双侧乳腺小叶增生左腋下副乳 肝、胆、胰、脾、左肾、右肾未发现明显异常 盆腔积液左附件、右附件...   
    9525  彩超（双侧甲状腺）未发现明显异常 右肾、左肾、膀胱、前列腺、双侧输尿管未发现明显异常 肝:脂...   
    9526  甲状腺超声未发现明显异常 前列腺未发现明显异常 肝:肝囊肿左肾:左肾结石右肾:右肾结石右肾囊...   
    9527     肝、胆、胰、脾、左肾、右肾未发现明显异常 双侧甲状腺未见明显异常 膀胱、前列腺未发现明显异常   
    9528  膀胱、前列腺未发现明显异常 甲状腺彩超（双侧）未发现明显异常 肝:肝内钙化灶胆、胰、脾、左肾...   
    9529  膀胱、前列腺未发现明显异常 肝:脂肪肝（非均匀性）肝囊肿胆、胰、脾、左肾、右肾未发现明显异常...   
    9530  脂肪肝（轻度）胆、胰、脾、左肾、右肾未发现明显异常 右侧颈总动脉斑块 膀胱、前列腺、双侧输尿...   
    9531  前列腺未发现明显异常 右肾:右肾结晶左肾:左肾结晶肝、胆、胰、脾未发现明显异常 甲状腺彩超未...   
    9532  甲状腺彩超（双侧）未发现明显异常 右肾:右肾结石左肾、膀胱、前列腺、双侧输尿管未发现明显异常...   
    9533  双侧颈总动脉斑块 甲状腺双叶结节 肝:脂肪肝（中度）左肾:左肾囊肿右肾:右肾囊肿胆、胰、脾未...   
    9534  肝:脂肪肝趋势胆、胰、脾、右肾、左肾未发现明显异常 前列腺未发现明显异常 颈动脉彩超未发现明显异常   
    9535                                                NaN   
    9536  双乳腺彩超—无图文未发现明显异常 膀胱:膀胱充盈欠佳左肾、右肾、子宫、左附件、右附件、双侧输...   
    9537  子宫:子宫肌瘤宫内节育器位置正常左附件、右附件未发现明显异常 肝:脂肪肝（轻度）胆、胰、脾、...   
    
                                ...                         979026  979027  \
    0                           ...                            NaN     NaN   
    1                           ...                            NaN     NaN   
    2                           ...                            NaN     NaN   
    3                           ...                            NaN     NaN   
    4                           ...                            NaN     NaN   
    5                           ...                            NaN     NaN   
    6                           ...                            NaN     NaN   
    7                           ...                            NaN     NaN   
    8                           ...                            NaN     NaN   
    9                           ...                            NaN     NaN   
    10                          ...                            NaN     NaN   
    11                          ...                            NaN     NaN   
    12                          ...                            NaN     NaN   
    13                          ...                            NaN     NaN   
    14                          ...                            NaN     NaN   
    15                          ...                            NaN     NaN   
    16                          ...                            NaN     NaN   
    17                          ...                            NaN     NaN   
    18                          ...                            NaN     NaN   
    19                          ...                            NaN     NaN   
    20                          ...                            NaN     NaN   
    21                          ...                            NaN     NaN   
    22                          ...                            NaN     NaN   
    23                          ...                            NaN     NaN   
    24                          ...                            NaN     NaN   
    25                          ...                            NaN     NaN   
    26                          ...                            NaN     NaN   
    27                          ...                            NaN     NaN   
    28                          ...                            NaN     NaN   
    29                          ...                            NaN     NaN   
    ...                         ...                            ...     ...   
    9508                        ...                            NaN     NaN   
    9509                        ...                            NaN     NaN   
    9510                        ...                            NaN     NaN   
    9511                        ...                            NaN     NaN   
    9512                        ...                            NaN     NaN   
    9513                        ...                            0.0     0.1   
    9514                        ...                            NaN     NaN   
    9515                        ...                            NaN     NaN   
    9516                        ...                            NaN     NaN   
    9517                        ...                            NaN     NaN   
    9518                        ...                            NaN     NaN   
    9519                        ...                            NaN     NaN   
    9520                        ...                            NaN     NaN   
    9521                        ...                            NaN     NaN   
    9522                        ...                            NaN     NaN   
    9523                        ...                            NaN     NaN   
    9524                        ...                            NaN     NaN   
    9525                        ...                            0.0     0.0   
    9526                        ...                            NaN     NaN   
    9527                        ...                            0.0     0.0   
    9528                        ...                            NaN     NaN   
    9529                        ...                            NaN     NaN   
    9530                        ...                            NaN     NaN   
    9531                        ...                            NaN     NaN   
    9532                        ...                            NaN     NaN   
    9533                        ...                            NaN     NaN   
    9534                        ...                            NaN     NaN   
    9535                        ...                            NaN     NaN   
    9536                        ...                            NaN     NaN   
    9537                        ...                            NaN     NaN   
    
                                                       A201  \
    0     L2-4腰椎椎体前缘呈骨性唇样改变。L1-2腰椎间隙略变窄，间盘呈条带状低密度、真空样改变。...   
    1     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    2     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    3     两侧胸廓对称。肺窗示两肺纹理清晰，走行自然，未见明显异常密度影。两侧肺门不大。纵隔窗示心影及...   
    4     两侧胸廓对称。肺窗示两肺上叶（image 15,26）见小类结节灶，直径约 4-6mm，边界...   
    5                                                   NaN   
    6                                                   NaN   
    7     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    8                                                   NaN   
    9     胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    10    胸廓对称，双肺纹理清晰，走形自然，未见异常实变影，双肺门不大。纵膈窗示纵膈无偏移，心影及大血...   
    11                                                  NaN   
    12                                                  NaN   
    13                                          左外胸膜下粟粒样结节影   
    14    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    15                                                  NaN   
    16         双基底节极侧脑室体旁、丘脑可见多个斑点状、斑片状　低密度灶，侧脑室无受压　中线结构居中。   
    17                                               详见纸质报告   
    18    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    19    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    20    两侧大脑半球，小脑及脑干形态正常，未见明显异常密度病灶，两侧脑室，第三脑室及第四脑室形态，密...   
    21    大脑、中脑、小脑密度未见异常。诸脑室大小形态正常，脑沟、脑池未见异常，中线居中。 胸廓对称，...   
    22                                                  NaN   
    23    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    24    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    25    两侧大脑半球，小脑及脑干形态正常，未见明显异常密度病灶，两侧脑室，第三脑室及第四脑室形态，密...   
    26                                                  NaN   
    27    胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    28                                                  NaN   
    29                                                  NaN   
    ...                                                 ...   
    9508                                                NaN   
    9509                                            nan nan   
    9510                                                NaN   
    9511                                                NaN   
    9512                                                NaN   
    9513  肝脏大小、形态正常，实质内未见异常密度影，肝内、外胆管未见扩张，胆囊大小正常，囊内未见明显阳...   
    9514                                                NaN   
    9515  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    9516  双肺纹理增粗、增多；双肺叶间胸膜增厚；胸廓双侧对称，双肺门不大;纵隔窗肺野内未见明显实性密度...   
    9517  两侧胸廓对称。肺窗示右肺（image8、22、25、28）见微小结节灶，大小约2-6mm，边...   
    9518  双肺上叶透亮度增高，可见多发小圆形空腔影；左肺下叶外底段及右肺中叶见纤维索条影，边界清晰。肺...   
    9519                                                NaN   
    9520  双肺纹理清晰，肺门结构正常；纵隔居中，纵隔内未见明确肿大淋巴结；心脏大血管形态、大小正常；双...   
    9521  两侧大脑半球，小脑及脑干形态如常，未见明显异常密度病灶，两侧脑室，第三脑室及第四脑室形态，密...   
    9522  两侧胸廓对称，左肺上叶、下叶及右肺中叶、下叶见多发结节影，较大者直径约4X3mm，边界清，边...   
    9523  胸廓对称，气管纵隔居中，双肺纹理清晰，走行自然，肺野透光度良好，双肺未见明显异常密度影。心影...   
    9524                                                NaN   
    9525                                             脂肪肝 轻度   
    9526  两侧胸廓对称，左肺上叶见直径2*3mm边缘未见毛刺结节影，右肺中叶少许陈旧灶，余肺纹理清晰走...   
    9527  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，左肺门小钙化灶，纵隔窗示纵隔无偏移，心影及...   
    9528  胸廓对称，双肺纹理清晰，走行自然，未见明显异常实变影，纵隔窗示纵隔无偏移，心影不大，右肺门及...   
    9529                                             详见纸质报告   
    9530  两侧大脑半球，小脑及脑干形态正常，未见明显异常密度病灶，两侧脑室，第三脑室及第四脑室形态，密...   
    9531  检查所见:右肺上叶可见一类圆形磨玻璃样密度影，边界模糊，直径约13mm；右肺中叶可见条索状稍...   
    9532                                                NaN   
    9533  胸廓对称，双肺纹理清晰，走行自然，未见异常实变影，双肺门不大。纵隔窗示纵隔无偏移，心影及大血...   
    9534                                                NaN   
    9535                                                NaN   
    9536                                                NaN   
    9537  两侧大脑半球，小脑及脑干形态如常，未见明显异常密度病灶，两侧脑室，第三脑室及第四脑室形态，密...   
    
                                                       A202  \
    0                            腰椎退行性变腰椎间盘退变 肺部CT扫描未发现明显异常   
    1                                      肺部CT（不出片）未发现明显异常   
    2                                           CT胸部未发现明显异常   
    3                                         胸部CT平扫未见明显异常。   
    4     1.两肺上叶小类结节灶，建议复查。2.右肺纤维灶伴左肺上叶小气囊。3.两上局部胸膜增厚。4....   
    5                                                   NaN   
    6                                                   NaN   
    7                                     64排CT肺部不出片未发现明显异常   
    8                                                   NaN   
    9                     头部CT（不出片）未发现明显异常 肺部CT（不出片）未发现明显异常   
    10                                            胸部扫描未见异常。   
    11                                                  NaN   
    12                                                  NaN   
    13                                          左外胸膜下粟粒样结节影   
    14                                         C（胸部）未发现明显异常   
    15                                                  NaN   
    16                                               腔隙性脑梗塞   
    17                                               详见纸质报告   
    18                                         促销项目2未发现明显异常   
    19                                        肺部CT扫描未发现明显异常   
    20                         肺部CT（不出片）未发现明显异常 头部CT未发现明显异常   
    21                    64排CT头部出片未发现明显异常 64排CT肺部出片未发现明显异常   
    22                                                  NaN   
    23                  16排CT肺部不出片未发现明显异常 16排CT头部不出片未发现明显异常   
    24                                        肺部CT扫描未发现明显异常   
    25                               C（头部）未发现明显异常 胸部扫描未见异常。   
    26                                                  NaN   
    27                                     肺部CT（不出片）未发现明显异常   
    28                                                  NaN   
    29                                                  NaN   
    ...                                                 ...   
    9508                                                NaN   
    9509                            详情请见CT检查报告单 详情请见CT检查报告单   
    9510                                                NaN   
    9511                                                NaN   
    9512                                                NaN   
    9513                                   上腹部CT体层扫描未发现明显异常   
    9514                                                NaN   
    9515                                      胸肺平扫CT未发现明显异常   
    9516                             双肺纹理增粗、增多双肺叶间胸膜增厚主动脉硬化   
    9517          1.右肺微结节灶；2.左肺上叶、右肺中叶及双肺下叶少许纤维灶；3.左肺下叶肺大泡。   
    9518             1、双肺上叶肺气肿。2、考虑双肺局灶性纤维化。3、主动脉硬化。4、胸椎退变。   
    9519                                                NaN   
    9520                    肺CT(不出片)未发现明显异常 脑CT(不出片)未发现明显异常   
    9521                                             双侧筛窦炎症   
    9522                        肝内低密度影，性质待定，建议CT增强进一步检查肺内结节   
    9523                                   肺部CT（不出片）未发现明显异常   
    9524                                                NaN   
    9525                                             脂肪肝 轻度   
    9526                                    肺内结节肺陈旧性病变肝囊肿可能   
    9527                                          左肺门陈旧性钙化灶   
    9528                                  纵隔内淋巴结钙化右肺门陈旧性钙化灶   
    9529                                             详见纸质报告   
    9530                                   颅脑CT(不出片）未发现明显异常   
    9531                    右肺上叶磨玻璃结节，建议随访复查。右肺中叶纤维化灶。胸椎退变。   
    9532                                                NaN   
    9533                                        胸部CT未发现明显异常   
    9534                                                NaN   
    9535                                                NaN   
    9536                                                NaN   
    9537                                        颅脑CT未发现明显异常   
    
                                                       A301  \
    0     双侧基底节、侧脑室旁、半卵圆中心可见斑片状长T1长T2信号，在FLAIR序列中上述部分病灶呈...   
    1                                                   NaN   
    2                                                   NaN   
    3                                                   NaN   
    4                                                   NaN   
    5                                                   NaN   
    6                                                   NaN   
    7                                                   NaN   
    8                                                   NaN   
    9                                                   NaN   
    10                                                  NaN   
    11                                                  NaN   
    12                                                  NaN   
    13                                                  NaN   
    14                                                  NaN   
    15                                                  NaN   
    16                                                  NaN   
    17                                                  NaN   
    18                                                  NaN   
    19      双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，F...   
    20                                                  NaN   
    21                                                  NaN   
    22                                                  NaN   
    23                                                  NaN   
    24    双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    25                                                  NaN   
    26                                                  NaN   
    27                                                  NaN   
    28                                                  NaN   
    29                                                  NaN   
    ...                                                 ...   
    9508                                                NaN   
    9509                                                NaN   
    9510                                                NaN   
    9511                                                NaN   
    9512                                             详见纸质报告   
    9513  双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    9514                                                NaN   
    9515                                                NaN   
    9516  （双）侧（额）叶皮层下见斑点状等T1长T2信号，在FLAIR序列呈高信号，脑室系统形态、大小...   
    9517  双侧额叶及右侧顶叶见少许点状异常信号病灶，T1WI低信号，T2WI高信号，FLAIR高信号，...   
    9518  双侧额叶白质见少许斑点状等T1、稍长T2信号，边界清晰，在FLAIR序列呈高信号，余脑实质形...   
    9519                                                NaN   
    9520                                                NaN   
    9521                                                NaN   
    9522  （双）侧（额 ）叶皮层下及半卵圆中心可见散在斑点状等T1长T2信号，在FLAIR序列呈高信号...   
    9523                                                NaN   
    9524                                                NaN   
    9525  双侧大脑半球对称，大脑灰白质形态、位置、信号未见异常。脑干、小脑实质未见明显异常信号，FLA...   
    9526  （右）侧（额）叶皮层下左侧半卵圆中心区可见斑点状等T1长T2信号，在FLAIR序列呈高信号，...   
    9527                                                NaN   
    9528                                                NaN   
    9529                                                NaN   
    9530                                                NaN   
    9531  大、小脑实质内未见异常信号，基底节结构正常。脑干形态及信号正常。脑室系统形态、大小及信号均未...   
    9532                                                NaN   
    9533                                                NaN   
    9534                                                NaN   
    9535                                                NaN   
    9536                                                NaN   
    9537                                                NaN   
    
                                                     A302                  A601  \
    0                               腔隙性脑梗塞 （部分软化灶）脑白质缺血改变                   NaN   
    1                                                 NaN                   NaN   
    2                                                 NaN                   NaN   
    3                                                 NaN                   NaN   
    4                                                 NaN                   NaN   
    5                                                 NaN                   NaN   
    6                                                 NaN                   NaN   
    7                                                 NaN         详见纸质报告 详见纸质报告   
    8                                                 NaN         详见纸质报告 详见纸质报告   
    9                                                 NaN                   NaN   
    10                                                NaN                   NaN   
    11                                                NaN                   NaN   
    12                                                NaN                   NaN   
    13                                                NaN                   NaN   
    14                                                NaN                   NaN   
    15                                                NaN                   NaN   
    16                                                NaN                详见纸质报告   
    17                                                NaN                   NaN   
    18                                                NaN                   NaN   
    19                                             左侧上颌窦炎           具体内容请见分析报告。   
    20                                                NaN                   NaN   
    21                                                NaN  详见纸质报告 详见纸质报告 详见纸质报告   
    22                                                NaN                详见纸质报告   
    23                                                NaN                   NaN   
    24                                       头部MRI未发现明显异常           具体内容请见分析报告。   
    25                                                NaN                   NaN   
    26                                                NaN                   NaN   
    27                                                NaN                   NaN   
    28                                                NaN                   NaN   
    29                                                NaN                详见纸质报告   
    ...                                               ...                   ...   
    9508                                              NaN                   NaN   
    9509                                              NaN                   NaN   
    9510                                              NaN                   NaN   
    9511                                              NaN                   NaN   
    9512                                           详见纸质报告                   NaN   
    9513                                  颅脑核磁共振成像未发现明显异常                   NaN   
    9514                                              NaN                   NaN   
    9515                                              NaN                   NaN   
    9516                                            脑内缺血灶                   NaN   
    9517                         1.双侧额叶及右侧顶叶少许缺血灶；2.副鼻窦炎。                   NaN   
    9518  T2/FLAIR序列双侧额叶白质高信号灶，Fazekas分级0级。右侧乳突区骨瘤？请结合查体。                详见纸质报告   
    9519                                              NaN                   NaN   
    9520                                              NaN                   NaN   
    9521                                              NaN                   NaN   
    9522                                            脑内缺血灶                   NaN   
    9523                                              NaN       结果详见报告单 结果详见报告单   
    9524                                              NaN                   NaN   
    9525                                  颅脑核磁共振成像未发现明显异常                   NaN   
    9526                                            脑内缺血灶                   NaN   
    9527                                              NaN                   NaN   
    9528                                              NaN                   NaN   
    9529                                              NaN                详见纸质报告   
    9530                                              NaN                   NaN   
    9531                                           双侧筛窦炎。                详见纸质报告   
    9532                                              NaN                详见纸质报告   
    9533                                              NaN                   NaN   
    9534                                              NaN                   NaN   
    9535                                              NaN                   NaN   
    9536                                              NaN                   NaN   
    9537                                              NaN                   NaN   
    
         A701 A703                                               A705  
    0     NaN  NaN                                                NaN  
    1     NaN  NaN                                                NaN  
    2     NaN  NaN                                                NaN  
    3     NaN  NaN                                                NaN  
    4     NaN  NaN                                                NaN  
    5     NaN  NaN                                                NaN  
    6     NaN  NaN                                                NaN  
    7     NaN  NaN                                                NaN  
    8     NaN  NaN                                                NaN  
    9     NaN  NaN                                                NaN  
    10    NaN  NaN                                                NaN  
    11    NaN  NaN                                                NaN  
    12    NaN  NaN                                                NaN  
    13    NaN  NaN                                                NaN  
    14    NaN  NaN                                                NaN  
    15    NaN  NaN                                                NaN  
    16    NaN  NaN                                                NaN  
    17    NaN  NaN                                                NaN  
    18    NaN  NaN                                                NaN  
    19    6.5  265                            脂肪衰减值大于240，肝脏脂肪含量超过正常值。  
    20    NaN  NaN                                                NaN  
    21    NaN  NaN                                                NaN  
    22    NaN  NaN                                                NaN  
    23    NaN  NaN                                                NaN  
    24    5.1  260                            脂肪衰减值大于240，肝脏脂肪含量超过正常值。  
    25    4.3  232                                       数字化肝超未发现明显异常  
    26    NaN  NaN                                                NaN  
    27    NaN  NaN                                                NaN  
    28    NaN  NaN                                                NaN  
    29    NaN  NaN                                                NaN  
    ...   ...  ...                                                ...  
    9508  NaN  NaN                                                NaN  
    9509  NaN  NaN                                                NaN  
    9510  NaN  NaN                                                NaN  
    9511  NaN  NaN                                                NaN  
    9512  NaN  NaN                                                NaN  
    9513  NaN  NaN                                                NaN  
    9514  NaN  NaN                                                NaN  
    9515  NaN  NaN                                                NaN  
    9516  NaN  NaN                                                NaN  
    9517  6.3  252  脂肪衰减值大于240，肝脏脂肪含量超过正常值。脂肪衰减值越大，肝脏脂肪含量越高，提示脂肪肝倾...  
    9518  NaN  NaN                                                NaN  
    9519  NaN  NaN                                                NaN  
    9520  NaN  NaN                                                NaN  
    9521  NaN  NaN                                                NaN  
    9522  NaN  NaN                                                NaN  
    9523  6.4  225                                       数字化肝超未发现明显异常  
    9524  NaN  NaN                                                NaN  
    9525  NaN  NaN                                                NaN  
    9526  NaN  NaN                                                NaN  
    9527  NaN  NaN                                                NaN  
    9528  NaN  NaN                                                NaN  
    9529  5.6  308  脂肪衰减值大于240，肝脏脂肪含量超过正常值。脂肪衰减值越大，肝脏脂肪含量越高，提示脂肪肝倾...  
    9530  NaN  NaN                                                NaN  
    9531  NaN  NaN                                                NaN  
    9532  NaN  NaN                                                NaN  
    9533  NaN  NaN                                                NaN  
    9534  NaN  NaN                                                NaN  
    9535  NaN  NaN                                                NaN  
    9536  NaN  NaN                                                NaN  
    9537  NaN  NaN                                                NaN  
    
    [9538 rows x 409 columns]>
    """

    """
    features = ['vid', 'Unnamed: 0', '004997']
    features = ['vid', '舒张压', '血清甘油三酯', '血清高密度脂蛋白', '血清低密度脂蛋白']
    labels = ['收缩压', '舒张压', '血清甘油三酯', '血清高密度脂蛋白', '血清低密度脂蛋白']

    X_train = train_data[features]
    y_train = train_data[labels]
    X_test = test_data[features]
    y_test = test_data[labels]

    # print X_train.shape
    # (38199, 5)
    # (38199, 3)
    # print y_train.shape
    # (38199, 1)
    # (38199, 5)

    clf = xgboost.XGBRegressor()
    # 回归问题，预测问题
    clf.fit(X_train, y_train)
    print 'Done'

    # y_pred = clf.predict(X_test)
    # y_pred = np.ndarray.round(y_pred, 3)
    # calc_logloss(y_test, y_pred)
    # 保留三位小数
    # y_test = pd.DataFrame(y_test, columns=['收缩压', '舒张压', '血清甘油三酯', '血清高密度脂蛋白', '血清低密度脂蛋白'])
    """
